Ran Plan for 9 projects:

1. dir: `gcp/organization` workspace: `default`
1. dir: `gcp/projects/firebees` workspace: `default`
1. dir: `gcp/projects/homelab-ng` workspace: `default`
1. dir: `gcp/projects/jonpulsifer` workspace: `default`
1. dir: `gcp/projects/kubesec` workspace: `default`
1. dir: `gcp/projects/lolcorp` workspace: `default`
1. dir: `gcp/projects/trusted-builds` workspace: `default`
1. dir: `gcp/projects/wishin-app` workspace: `default`
1. dir: `workspace` workspace: `default`
---

### 1. dir: `gcp/organization` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place

Terraform will perform the following actions:

  # google_org_policy_policy.allow_cloud_logging will be created
+ resource "google_org_policy_policy" "allow_cloud_logging" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/gcp.disableCloudLogging"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "FALSE"
            }
        }
    }

  # google_org_policy_policy.allow_users_to_see_org_projects_only will be created
+ resource "google_org_policy_policy" "allow_users_to_see_org_projects_only" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/resourcemanager.accessBoundaries"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               values {
+                   allowed_values = [
+                       "under:organizations/5046617773",
                    ]
                }
            }
        }
    }

  # google_org_policy_policy.allowed_locations will be created
+ resource "google_org_policy_policy" "allowed_locations" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/gcp.resourceLocations"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               values {
+                   allowed_values = [
+                       "in:canada-locations",
                    ]
                }
            }
        }
    }

  # google_org_policy_policy.cloudkms_allowedProtectionLevels will be created
+ resource "google_org_policy_policy" "cloudkms_allowedProtectionLevels" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/cloudkms.allowedProtectionLevels"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               values {
+                   allowed_values = [
+                       "SOFTWARE",
                    ]
                }
            }
        }
    }

  # google_org_policy_policy.compute_requireVpcflowLogs will be created
+ resource "google_org_policy_policy" "compute_requireVpcflowLogs" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.requireVpcFlowLogs"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           reset       = true
+           update_time = (known after apply)
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["ainotebooks.disableFileDownloads"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/ainotebooks.disableFileDownloads"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["ainotebooks.disableRootAccess"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/ainotebooks.disableRootAccess"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["ainotebooks.disableTerminal"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/ainotebooks.disableTerminal"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["ainotebooks.requireAutoUpgradeSchedule"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/ainotebooks.requireAutoUpgradeSchedule"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["ainotebooks.restrictPublicIp"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/ainotebooks.restrictPublicIp"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["appengine.disableCodeDownload"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/appengine.disableCodeDownload"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["bigquery.disableBQOmniAWS"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/bigquery.disableBQOmniAWS"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["bigquery.disableBQOmniAzure"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/bigquery.disableBQOmniAzure"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["cloudbuild.disableCreateDefaultServiceAccount"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/cloudbuild.disableCreateDefaultServiceAccount"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["clouddeploy.disableServiceLabelGeneration"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/clouddeploy.disableServiceLabelGeneration"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["cloudfunctions.requireVPCConnector"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/cloudfunctions.requireVPCConnector"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["cloudkms.disableBeforeDestroy"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known a
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.